# FLWByClass

## Description
Function FLWByClass returns whether the global attributes are set to use the line weight of the default class.

```pascal
FUNCTION FLWByClass : BOOLEAN;
```

```python

def vs.FLWByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the line weight of the default class.<BR>
[sd 8/19/98]

## Examples
```pascal
useClassLWidth:=FLWByClass;
```

## Version
Availability: from VectorWorks8.0
## Category
* Document Attributes